---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFieldType.CombinedParameter
enum: Autodesk.Revit.DB.ScheduleFieldType
source: html/9888db7d-00d0-4fd7-a1a9-cdd1fb5fce16.htm
---
# Autodesk.Revit.DB.ScheduleFieldType.CombinedParameter

Combine parameters of the types that display in a specific part of a
 schedule. The values for the combined parameters will display in the
 same cell separated by a slash or other separator. You can add a prefix,
 suffix or sample value to the parameter.